# ETL de datos de importación de productos

## Instalación de librerías base

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import uuid

## Extraction

In [2]:
engine = create_engine('postgresql+psycopg2://root:postgres@localhost/root')

In [3]:
df_trades = pd.read_sql("select * from trades", engine)
df_trades.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items

In [4]:
df_countries = pd.read_json('src/country_data.json')
df_countries.head()

,country,images_file,image_url,alpha-2,alpha-3,country-code,iso_3166-2,region,sub-region,intermediate-region,region-code,sub-region-code,intermediate-region-code
0,Afghanistan,Flag_of_Afghanistan.svg,https://upload.wikimedia.org/wikipedia/commons...,AF,AFG,4.0,ISO 3166-2:AF,Asia,Southern Asia,None,142.0,34.0,NaN
1,Albania,Flag_of_Albania.svg,https://upload.wikimedia.org/wikipedia/commons...,AL,ALB,8.0,ISO 3166-2:AL,Europe,Southern Europe,None,150.0,39.0,NaN
10,Azerbaijan,Flag_of_Azerbaijan.svg,https://upload.wikimedia.org/wikipedia/commons...,AZ,AZE,31.0,ISO 3166-2:AZ,Asia,Western Asia,None,142.0,145.0,NaN
100,Lithuania,Flag_of_Lithuania.svg,https://upload.wikimedia.org/wikipedia/commons...,LT,LTU,440.0,ISO 3166-2:LT,Europe,Northern Europe,None,150.0,154.0,NaN
101,Luxembourg,Flag_of_Luxembourg.svg,https://upload.wikimedia.org/wikipedia/commons...,LU,LUX,442.0,ISO 3166-2:LU,Europe,Western Europe,None,150.0,155.0,NaN

In [5]:
df_codes = pd.read_csv('src/hs_codes.csv')
df_codes.head()

,Order,Level,Code,Parent,Code_comm,Parent.1,Description_complex,Description
0,1654555,1,0,NaN,NaN,NaN,This classification has been uploaded in RAMON...,This classification has been uploaded in RAMON...
1,1654556,1,10011000090,NaN,I,NaN,SECTION I - LIVE ANIMALS; ANIMAL PRODUCTS,LIVE ANIMALS; ANIMAL PRODUCTS
2,1654557,2,10021000090,1.001100e+10,1,I,CHAPTER 1 - LIVE ANIMALS,LIVE ANIMALS
3,1654558,3,10100000080,1.002100e+10,1.01,1,"Live horses, asses, mules and hinnies","Live horses, asses, mules and hinnies"
4,1654559,4,10121000010,1.010000e+10,NaN,1.01,- Horses,NaN

## Transform

#### Clean codes

In [9]:
df_codes = df_codes[df_codes['Code_comm'].notnull()]
df_codes.head()

,Order,Level,Code,Parent,Code_comm,Parent.1,Description_complex,Description
1,1654556,1,10011000090,NaN,I,NaN,SECTION I - LIVE ANIMALS; ANIMAL PRODUCTS,LIVE ANIMALS; ANIMAL PRODUCTS
2,1654557,2,10021000090,1.001100e+10,1,I,CHAPTER 1 - LIVE ANIMALS,LIVE ANIMALS
3,1654558,3,10100000080,1.002100e+10,1.01,1,"Live horses, asses, mules and hinnies","Live horses, asses, mules and hinnies"
5,1654560,5,10121000080,1.012100e+10,101.21,NaN,-- Pure-bred breeding animals,Pure-bred breeding horses
6,1654561,5,10129000080,1.012100e+10,101.29,NaN,-- Other,Live horses (excl. pure-bred for breeding)

In [8]:
def clean_code(text):
    text = str(text)
    parent_code = None
    if len(text) == 11:
        code = text[:5]
        parent_code = text[:1]
    else:
        code = text[:6]
        parent_code = text[:2]
    try:
        parent = df_parents[df_parents['Code_comm']==parent_code]['Description'].values[0]
    except:
        parent = None
    return (code,parent)

In [10]:
df_codes[['clean_code','parent_description']] = df_codes.apply(lambda x : clean_code(x['Code']),axis=1, result_type='expand')
df_codes.head()

,Order,Level,Code,Parent,Code_comm,Parent.1,Description_complex,Description,clean_code,parent_description
1,1654556,1,10011000090,NaN,I,NaN,SECTION I - LIVE ANIMALS; ANIMAL PRODUCTS,LIVE ANIMALS; ANIMAL PRODUCTS,10011,None
2,1654557,2,10021000090,1.001100e+10,1,I,CHAPTER 1 - LIVE ANIMALS,LIVE ANIMALS,10021,None
3,1654558,3,10100000080,1.002100e+10,1.01,1,"Live horses, asses, mules and hinnies","Live horses, asses, mules and hinnies",10100,None
5,1654560,5,10121000080,1.012100e+10,101.21,NaN,-- Pure-bred breeding animals,Pure-bred breeding horses,10121,None
6,1654561,5,10129000080,1.012100e+10,101.29,NaN,-- Other,Live horses (excl. pure-bred for breeding),10129,None

In [11]:
df_codes = df_codes[df_codes['clean_code'].notnull()][['clean_code','Description','parent_description']]
#Remove the other columns and apply notnull
df_codes.head()

  clean_code                                 Description parent_description
1      10011               LIVE ANIMALS; ANIMAL PRODUCTS               None
2      10021                                LIVE ANIMALS               None
3      10100       Live horses, asses, mules and hinnies               None
5      10121                   Pure-bred breeding horses               None
6      10129  Live horses (excl. pure-bred for breeding)               None

In [17]:
df_codes['id_code'] = df_codes.index + 1
#Create Index
df_codes.head()

,clean_code,Description,parent_description,id_code
1,10011,LIVE ANIMALS; ANIMAL PRODUCTS,None,2
2,10021,LIVE ANIMALS,None,3
3,10100,"Live horses, asses, mules and hinnies",None,4
5,10121,Pure-bred breeding horses,None,6
6,10129,Live horses (excl. pure-bred for breeding),None,7

In [13]:
df_codes['clean_code'] = df_codes['clean_code'].astype('int64')
#Turn clean code into an Integer column
df_codes.head()

,clean_code,Description,parent_description,id_code
1,10011,LIVE ANIMALS; ANIMAL PRODUCTS,None,2
2,10021,LIVE ANIMALS,None,3
3,10100,"Live horses, asses, mules and hinnies",None,4
5,10121,Pure-bred breeding horses,None,6
6,10129,Live horses (excl. pure-bred for breeding),None,7

### Clean Countries

In [15]:
df_countries = df_countries[['alpha-3','country','region','sub-region']]
#Remove the other columns
df_countries.head()

    alpha-3      country  region       sub-region
0       AFG  Afghanistan    Asia    Southern Asia
1       ALB      Albania  Europe  Southern Europe
10      AZE   Azerbaijan    Asia     Western Asia
100     LTU    Lithuania  Europe  Northern Europe
101     LUX   Luxembourg  Europe   Western Europe

In [16]:
df_countries = df_countries[df_countries['alpha-3'].notnull()]
#Remove nulls
df_countries.head()

    alpha-3      country  region       sub-region
0       AFG  Afghanistan    Asia    Southern Asia
1       ALB      Albania  Europe  Southern Europe
10      AZE   Azerbaijan    Asia     Western Asia
100     LTU    Lithuania  Europe  Northern Europe
101     LUX   Luxembourg  Europe   Western Europe

In [18]:
df_countries['id_country'] = df_countries.index + 1
#Create Index
df_countries.head()

    alpha-3      country  region       sub-region  id_country
0       AFG  Afghanistan    Asia    Southern Asia           1
1       ALB      Albania  Europe  Southern Europe           2
10      AZE   Azerbaijan    Asia     Western Asia          11
100     LTU    Lithuania  Europe  Northern Europe         101
101     LUX   Luxembourg  Europe   Western Europe         102

### Merge

In [19]:
df_trades_clean = df_trades.merge(df_codes[['clean_code','id_code']],how='left', left_on='comm_code',right_on='clean_code')
#Merge trades(sql) and codes(csv)
df_trades_clean.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name,clean_code,id_code
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items,890200,6929
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items,890310,6931
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items,890310,6931
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items,890310,6931
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items,890391,6933

In [20]:
df_trades_clean = df_trades_clean.merge(df_countries[['alpha-3','id_country']],how='left', left_on='country_code',right_on='alpha-3')
#Merge trades clean and Country(json)
df_trades_clean.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name,clean_code,id_code,alpha-3,id_country
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items,890200,6929,SYC,155
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items,890310,6931,SYC,155
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items,890391,6933,SYC,155

### Clean trades

In [21]:
def create_dimension(data, id_name):
    list_keys = []
    value = 1
    for _ in data:
        list_keys.append(value)
        value = value + 1
    return pd.DataFrame({id_name:list_keys, 'values':data})

In [22]:
df_quantity =create_dimension(df_trades_clean['quantity_name'].unique(),'id_quantity')
df_flow =create_dimension(df_trades_clean['flow'].unique(),'id_flow')
df_year =create_dimension(df_trades_clean['year'].unique(),'id_year')

In [23]:
df_quantity.head()

   id_quantity               values
0            1      Number of items
1            2  Weight in kilograms
2            3          No Quantity
3            4     Volume in litres
4            5      Number of pairs

In [24]:
df_flow.head()

   id_flow     values
0        1     Import
1        2     Export
2        3  Re-Export
3        4  Re-Import

In [25]:
df_year.head()

   id_year  values
0        1    1998
1        2    1997
2        3    1996
3        4    1995
4        5    1994

In [26]:
df_trades_clean = df_trades_clean.merge(df_quantity, how='left',left_on='quantity_name', right_on='values')
#Merge Clean Trades and Quantity
df_trades_clean.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name,clean_code,id_code,alpha-3,id_country,id_quantity,values
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items,890200,6929,SYC,155,1,Number of items
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items,890310,6931,SYC,155,1,Number of items
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items,890391,6933,SYC,155,1,Number of items

In [27]:
df_trades_clean = df_trades_clean.merge(df_flow, how='left',left_on='flow', right_on='values')
#Merge Clean Trades and Flow
df_trades_clean.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name,clean_code,id_code,alpha-3,id_country,id_quantity,values_x,id_flow,values_y
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items,890200,6929,SYC,155,1,Number of items,1,Import
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items,890310,6931,SYC,155,1,Number of items,1,Import
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items,2,Export
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items,3,Re-Export
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items,890391,6933,SYC,155,1,Number of items,1,Import

In [28]:
df_trades_clean = df_trades_clean.merge(df_year, how='left',left_on='year', right_on='values')
#Merge Clean Trades and Year
df_trades_clean.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name,clean_code,id_code,alpha-3,id_country,id_quantity,values_x,id_flow,values_y,id_year,values
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items,890200,6929,SYC,155,1,Number of items,1,Import,1,1998
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items,890310,6931,SYC,155,1,Number of items,1,Import,1,1998
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items,2,Export,1,1998
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items,3,Re-Export,1,1998
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items,890391,6933,SYC,155,1,Number of items,1,Import,1,1998

In [29]:
df_trades_clean['id_trades'] = df_trades_clean.index + 1
#Create Ids based on Index
df_trades_clean.head()

,country_code,year,comm_code,flow,trade_usd,kg,quantity,quantity_name,clean_code,id_code,alpha-3,id_country,id_quantity,values_x,id_flow,values_y,id_year,values,id_trades
0,SYC,1998,890200,Import,1431426.0,0.0,23000.0,Number of items,890200,6929,SYC,155,1,Number of items,1,Import,1,1998,1
1,SYC,1998,890310,Import,31406.0,0.0,2545.0,Number of items,890310,6931,SYC,155,1,Number of items,1,Import,1,1998,2
2,SYC,1998,890310,Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items,2,Export,1,1998,3
3,SYC,1998,890310,Re-Export,950.0,0.0,300.0,Number of items,890310,6931,SYC,155,1,Number of items,3,Re-Export,1,1998,4
4,SYC,1998,890391,Import,18251.0,0.0,450.0,Number of items,890391,6933,SYC,155,1,Number of items,1,Import,1,1998,5

In [30]:
df_trades_final = df_trades_clean[['id_trades','trade_usd','kg','quantity','id_code','id_country','id_quantity','id_flow','id_year']].copy()
#Create the Trades table with the needed metrics
df_trades_final.head()

,id_trades,trade_usd,kg,quantity,id_code,id_country,id_quantity,id_flow,id_year
0,1,1431426.0,0.0,23000.0,6929,155,1,1,1
1,2,31406.0,0.0,2545.0,6931,155,1,1,1
2,3,950.0,0.0,300.0,6931,155,1,2,1
3,4,950.0,0.0,300.0,6931,155,1,3,1
4,5,18251.0,0.0,450.0,6933,155,1,1,1

In [31]:
df_countries = df_countries[['id_country','alpha-3','country','region','sub-region']]
#Create the Countries with the needed metrics
df_countries.head()

     id_country alpha-3      country  region       sub-region
0             1     AFG  Afghanistan    Asia    Southern Asia
1             2     ALB      Albania  Europe  Southern Europe
10           11     AZE   Azerbaijan    Asia     Western Asia
100         101     LTU    Lithuania  Europe  Northern Europe
101         102     LUX   Luxembourg  Europe   Western Europe

In [32]:
df_codes = df_codes[['id_code','clean_code','Description','parent_description']]
#Create the Codes table with the needed metrics
df_codes.head()

,id_code,clean_code,Description,parent_description
1,2,10011,LIVE ANIMALS; ANIMAL PRODUCTS,None
2,3,10021,LIVE ANIMALS,None
3,4,10100,"Live horses, asses, mules and hinnies",None
5,6,10121,Pure-bred breeding horses,None
6,7,10129,Live horses (excl. pure-bred for breeding),None

## Load

In [6]:
import os
import boto3